stxent/halm/include/halm/platform/imxrt/usb_defs.h
/*
 * halm/platform/imxrt/usb_defs.h
 * Copyright (C) 2024 xent
 * Project is distributed under the terms of the MIT License
 */

#ifndef HALM_PLATFORM_IMXRT_USB_DEFS_H_
#define HALM_PLATFORM_IMXRT_USB_DEFS_H_
/*----------------------------------------------------------------------------*/
#include <xcore/bits.h>
#include <stdint.h>
/*------------------General Purpose Timer Load register-----------------------*/
#define GPTIMERLD_GPTLD_MAX             MASK(24)
/*------------------General Purpose Timer Control register--------------------*/
#define GPTIMERCTRL_GPTCNT_MASK         BIT_FIELD(MASK(24), 0)
#define GPTIMERCTRL_GPTCNT(value)       BIT_FIELD((value), 0)
#define GPTIMERCTRL_GPTCNT_VALUE(reg) \
    FIELD_VALUE((reg), GPTIMERCTRL_GPTCNT_MASK, 0)

#define GPTIMERCTRL_GPTMODE             MASK(24)
#define GPTIMERCTRL_GPTRST              MASK(30)
#define GPTIMERCTRL_GPTRUN              MASK(31)
/*------------------System Bus Config register--------------------------------*/
enum
{
  /* Bursts of unspecified length */
  AHB_BRST_INCR_UNSPECIFIED   = 0,

  /* Non-multiple transfers will be decomposed into singles */
  AHB_BRST_INCR4              = 1,
  /* Non-multiple transfers will be decomposed into INCR4 or singles */
  AHB_BRST_INCR8              = 2,
  /* Non-multiple transfers will be decomposed into INCR8, INCR4 or singles */
  AHB_BRST_INCR16             = 3,

  /* Non-multiple transfers will be decomposed into unspecified length bursts */
  AHB_BRST_INCR4_UNSPECIFIED  = 5,
  AHB_BRST_INCR8_UNSPECIFIED  = 6,
  AHB_BRST_INCR16_UNSPECIFIED = 7
};

#define SBUSCFG_AHBBRST(value)          BIT_FIELD((value), 0)
#define SBUSCFG_AHBBRST_MASK            BIT_FIELD(MASK(3), 0)
#define SBUSCFG_AHBBRST_VALUE(reg) \
    FIELD_VALUE((reg), SBUSCFG_AHBBRST_MASK, 0)
/*------------------USB Command register--------------------------------------*/
/* Device mode */
#define USBCMD_D_RS                     BIT(0)
#define USBCMD_D_RST                    BIT(1)
#define USBCMD_D_SUTW                   BIT(13)
#define USBCMD_D_ATDTW                  BIT(14)
#define USBCMD_D_ITC_MASK               BIT_FIELD(MASK(8), 16)
#define USBCMD_D_ITC(value)             BIT_FIELD((value), 16)
#define USBCMD_D_ITC_VALUE(reg) \
    FIELD_VALUE((reg), USBCMD_D_ITC_MASK, 16)

/* Host mode */
#define USBCMD_H_RS                     BIT(0)
#define USBCMD_H_RST                    BIT(1)
#define USBCMD_H_FS0                    BIT(2)
#define USBCMD_H_FS1                    BIT(3)
#define USBCMD_H_PSE                    BIT(4)
#define USBCMD_H_ASE                    BIT(5)
#define USBCMD_H_IAA                    BIT(6)
#define USBCMD_H_ASP1_0(value)          BIT_FIELD((value), 8)
#define USBCMD_H_ASPE                   BIT(11)
#define USBCMD_H_FS2                    BIT(15)
#define USBCMD_H_ITC(value)             BIT_FIELD((value), 16)
/*------------------USB Status register---------------------------------------*/
/* Device mode */
#define USBSTS_D_UI                     BIT(0)
#define USBSTS_D_UEI                    BIT(1)
#define USBSTS_D_PCI                    BIT(2)
#define USBSTS_D_SEI                    BIT(4)
#define USBSTS_D_AAI                    BIT(5)
#define USBSTS_D_URI                    BIT(6)
#define USBSTS_D_SRI                    BIT(7)
#define USBSTS_D_SLI                    BIT(8)
#define USBSTS_D_ULPII                  BIT(10)
#define USBSTS_D_NAKI                   BIT(16)
#define USBSTS_D_TI0                    BIT(24)
#define USBSTS_D_TI1                    BIT(25)

/* Host mode */
#define USBSTS_H_UI                     BIT(0)
#define USBSTS_H_UEI                    BIT(1)
#define USBSTS_H_PCI                    BIT(2)
#define USBSTS_H_FRI                    BIT(3)
#define USBSTS_H_SEI                    BIT(4)
#define USBSTS_H_AAI                    BIT(5)
#define USBSTS_H_SRI                    BIT(7)
#define USBSTS_H_ULPII                  BIT(10)
#define USBSTS_H_HCH                    BIT(12)
#define USBSTS_H_RCL                    BIT(13)
#define USBSTS_H_PS                     BIT(14)
#define USBSTS_H_AS                     BIT(15)
#define USBSTS_H_UAI                    BIT(18)
#define USBSTS_H_UPI                    BIT(19)
#define USBSTS_H_TI0                    BIT(24)
#define USBSTS_H_TI1                    BIT(25)
/*------------------USB Interrupt register------------------------------------*/
/* Device mode */
#define USBINTR_D_UE                    BIT(0)
#define USBINTR_D_UEE                   BIT(1)
#define USBINTR_D_PCE                   BIT(2)
#define USBINTR_D_SEE                   BIT(4)
#define USBINTR_D_URE                   BIT(6)
#define USBINTR_D_SRE                   BIT(7)
#define USBINTR_D_SLE                   BIT(8)
#define USBINTR_D_ULPIE                 BIT(10)
#define USBINTR_D_NAKE                  BIT(16)
#define USBINTR_D_TI0                   BIT(24)
#define USBINTR_D_TI1                   BIT(25)

/* Host mode */
#define USBINTR_H_UE                    BIT(0)
#define USBINTR_H_UEE                   BIT(1)
#define USBINTR_H_PCE                   BIT(2)
#define USBINTR_H_FRE                   BIT(3)
#define USBINTR_H_SEE                   BIT(4)
#define USBINTR_H_AEE                   BIT(5)
#define USBINTR_H_SRE                   BIT(7)
#define USBINTR_H_ULPIE                 BIT(10)
#define USBINTR_H_UAIE                  BIT(18)
#define USBINTR_H_UPIA                  BIT(19)
#define USBINTR_H_TI0                   BIT(24)
#define USBINTR_H_TI1                   BIT(25)
/*------------------Device Address register-----------------------------------*/
#define DEVICEADDR_USBADRA              BIT(24)
#define DEVICEADDR_USBADR(value)        BIT_FIELD((value), 25)
#define DEVICEADDR_USBADR_MASK          BIT_FIELD(MASK(7), 25)
#define DEVICEADDR_USBADR_VALUE(reg) \
    FIELD_VALUE((reg), DEVICEADDR_USBADR_MASK, 25)
/*------------------Programmable Burst Size register--------------------------*/
#define BURSTSIZE_RXPBURST(value)       BIT_FIELD((value), 0)
#define BURSTSIZE_RXPBURST_MASK         BIT_FIELD(MASK(8), 0)
#define BURSTSIZE_RXPBURST_VALUE(reg) \
    FIELD_VALUE((reg), BURSTSIZE_RXPBURST_MASK, 0)

#define BURSTSIZE_TXPBURST(value)       BIT_FIELD((value), 8)
#define BURSTSIZE_TXPBURST_MASK         BIT_FIELD(MASK(9), 8)
#define BURSTSIZE_TXPBURST_VALUE(reg) \
    FIELD_VALUE((reg), BURSTSIZE_TXPBURST_MASK, 8)
/*------------------TX FIFO Fill Tuning register------------------------------*/
#define TXFILLTUNING_TXSCHOH(value)     BIT_FIELD((value), 0)
#define TXFILLTUNING_TXSCHOH_MASK       BIT_FIELD(MASK(8), 0)
#define TXFILLTUNING_TXSCHOH_VALUE(reg) \
    FIELD_VALUE((reg), TXFILLTUNING_TXSCHOH_MASK, 0)

