stxent/halm/include/halm/platform/imxrt/usb_defs.h
#define TXFILLTUNING_TXSCHHEALTH(value) BIT_FIELD((value), 8)
#define TXFILLTUNING_TXSCHHEALTH_MASK   BIT_FIELD(MASK(5), 8)
#define TXFILLTUNING_TXSCHHEALTH_VALUE(reg) \
    FIELD_VALUE((reg), TXFILLTUNING_TXSCHHEALTH_MASK, 8)

#define TXFILLTUNING_TXFIFOTHRES(value) BIT_FIELD((value), 16)
#define TXFILLTUNING_TXFIFOTHRES_MASK   BIT_FIELD(MASK(6), 16)
#define TXFILLTUNING_TXFIFOTHRES_VALUE(reg) \
    FIELD_VALUE((reg), TXFILLTUNING_TXFIFOTHRES_MASK, 16)
/*------------------Configure Flash register----------------------------------*/
#define CONFIGFLAG_CF                   BIT(0)
/*------------------Port Status and Control register--------------------------*/
enum
{
  PSPD_FULL_SPEED = 0,
  PSPD_LOW_SPEED  = 1, /* In Host mode only */
  PSPD_HIGH_SPEED = 2
};

/* Device mode */
#define PORTSC1_D_CCS                   BIT(0)
#define PORTSC1_D_PE                    BIT(2)
#define PORTSC1_D_PEC                   BIT(3)
#define PORTSC1_D_FPR                   BIT(6)
#define PORTSC1_D_SUSP                  BIT(7)
#define PORTSC1_D_PR                    BIT(8)
#define PORTSC1_D_HSP                   BIT(9)

#define PORTSC1_D_PIC(value)            BIT_FIELD((value), 14)
#define PORTSC1_D_PIC_MASK              BIT_FIELD(MASK(2), 14)
#define PORTSC1_D_PIC_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_D_PIC_MASK, 14)

#define PORTSC1_D_PTC(value)            BIT_FIELD((value), 16)
#define PORTSC1_D_PTC_MASK              BIT_FIELD(MASK(4), 16)
#define PORTSC1_D_PTC_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_D_PTC_MASK, 16)

#define PORTSC1_D_PHCD                  BIT(23)
#define PORTSC1_D_PFSC                  BIT(24)
#define PORTSC1_D_PTS_2                 BIT(25)

#define PORTSC1_D_PSPD_MASK             BIT_FIELD(MASK(2), 26)
#define PORTSC1_D_PSPD_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_D_PSPD_MASK, 26)

#define PORTSC1_D_PTW                   BIT(28)
#define PORTSC1_D_STS                   BIT(29)
#define PORTSC1_D_PTS_0                 BIT(30)
#define PORTSC1_D_PTS_1                 BIT(31)

/* Host mode */
#define PORTSC1_H_CCS                   BIT(0)
#define PORTSC1_H_CSC                   BIT(1)
#define PORTSC1_H_PE                    BIT(2)
#define PORTSC1_H_PEC                   BIT(3)
#define PORTSC1_H_OCA                   BIT(4)
#define PORTSC1_H_OCC                   BIT(5)
#define PORTSC1_H_FPR                   BIT(6)
#define PORTSC1_H_SUSP                  BIT(7)
#define PORTSC1_H_PR                    BIT(8)
#define PORTSC1_H_HSP                   BIT(9)

#define PORTSC1_H_LS(value)             BIT_FIELD((value), 10)
#define PORTSC1_H_LS_MASK               BIT_FIELD(MASK(2), 10)
#define PORTSC1_H_LS_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_H_LS_MASK, 10)

#define PORTSC1_H_PP                    BIT(12)
#define PORTSC1_H_PO                    BIT(13)

#define PORTSC1_H_PIC(value)            BIT_FIELD((value), 14)
#define PORTSC1_H_PIC_MASK              BIT_FIELD(MASK(2), 14)
#define PORTSC1_H_PIC_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_H_PIC_MASK, 14)

#define PORTSC1_H_PTC(value)            BIT_FIELD((value), 16)
#define PORTSC1_H_PTC_MASK              BIT_FIELD(MASK(4), 16)
#define PORTSC1_H_PTC_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_H_PTC_MASK, 16)

#define PORTSC1_H_WKCN                  BIT(20)
#define PORTSC1_H_WKDC                  BIT(21)
#define PORTSC1_H_WKOC                  BIT(22)
#define PORTSC1_H_PHCD                  BIT(23)
#define PORTSC1_H_PFSC                  BIT(24)
#define PORTSC1_H_PTS_2                 BIT(25)

#define PORTSC1_H_PSPD(value)           BIT_FIELD((value), 26)
#define PORTSC1_H_PSPD_MASK             BIT_FIELD(MASK(2), 26)
#define PORTSC1_H_PSPD_VALUE(reg) \
    FIELD_VALUE((reg), PORTSC1_H_PSPD_MASK, 26)

#define PORTSC1_H_PTW                   BIT(28)
#define PORTSC1_H_STS                   BIT(29)
#define PORTSC1_H_PTS_0                 BIT(30)
#define PORTSC1_H_PTS_1                 BIT(31)
/*------------------OTG Status and Control register---------------------------*/
#define OTGSC_VD                        BIT(0)
#define OTGSC_VC                        BIT(1)
#define OTGSC_OT                        BIT(3)
#define OTGSC_DP                        BIT(4)
#define OTGSC_IDPU                      BIT(5)
#define OTGSC_ID                        BIT(8)
#define OTGSC_AVV                       BIT(9)
#define OTGSC_ASV                       BIT(10)
#define OTGSC_BSV                       BIT(11)
#define OTGSC_BSE                       BIT(12)
#define OTGSC_TOG_1MS                   BIT(13)
#define OTGSC_DPS                       BIT(14)
#define OTGSC_IDIS                      BIT(16)
#define OTGSC_AVVIS                     BIT(17)
#define OTGSC_ASVIS                     BIT(18)
#define OTGSC_BSVIS                     BIT(19)
#define OTGSC_BSEIS                     BIT(20)
#define OTGSC_STATUS_1MS                BIT(21)
#define OTGSC_DPIS                      BIT(22)
#define OTGSC_IDIE                      BIT(24)
#define OTGSC_AVVIE                     BIT(25)
#define OTGSC_ASVIE                     BIT(26)
#define OTGSC_BSVIE                     BIT(27)
#define OTGSC_BSEIE                     BIT(28)
#define OTGSC_EN_1MS                    BIT(29)
#define OTGSC_DPIE                      BIT(30)
/*------------------USB Mode register-----------------------------------------*/
enum
{
  CM_IDLE               = 0,
  CM_DEVICE_CONTROLLER  = 2,
  CM_HOST_CONTROLLER    = 3
};

/* Device mode */
#define USBMODE_D_CM(value)             BIT_FIELD((value), 0)
#define USBMODE_D_ES                    BIT(2)
#define USBMODE_D_SLOM                  BIT(3)
#define USBMODE_D_SDIS                  BIT(4)

/* Host mode */
#define USBMODE_H_CM(value)             BIT_FIELD((value), 0)
#define USBMODE_H_ES                    BIT(2)
#define USBMODE_H_SDIS                  BIT(4)
/*------------------USB Endpoint Control registers----------------------------*/
#define ENDPTCTRL_RXS                   BIT(0)
#define ENDPTCTRL_RXT(value)            BIT_FIELD((value), 2)
#define ENDPTCTRL_RXI                   BIT(5)
#define ENDPTCTRL_RXR                   BIT(6)
#define ENDPTCTRL_RXE                   BIT(7)
#define ENDPTCTRL_TXS                   BIT(16)
#define ENDPTCTRL_TXT(value)            BIT_FIELD((value), 18)
#define ENDPTCTRL_TXI                   BIT(21)
#define ENDPTCTRL_TXR                   BIT(22)
#define ENDPTCTRL_TXE                   BIT(23)
/*------------------All endpoint-related registers----------------------------*/
#define ENDPT_BIT(ep)                   BIT(((ep) & 0x07) + ((ep) >> 3))
/*------------------OTG Control register--------------------------------------*/
#define OTG_CTRL_OVER_CUR_DIS           BIT(7)
#define OTG_CTRL_OVER_CUR_POL           BIT(8)
#define OTG_CTRL_PWR_POL                BIT(9)
#define OTG_CTRL_WIE                    BIT(10)
#define OTG_CTRL_WKUP_SW_EN             BIT(14)
#define OTG_CTRL_WKUP_SW                BIT(15)
#define OTG_CTRL_WKUP_ID_EN             BIT(16)
#define OTG_CTRL_WKUP_VBUS_EN           BIT(17)
#define OTG_CTRL_WKUP_DPDM_EN           BIT(29)
#define OTG_CTRL_WIR                    BIT(31)
/*------------------OTG UTMI PHY Control register-----------------------------*/
#define OTG_PHY_CTRL_UTMI_CLK_VLD       BIT(31)
/*------------------PHY Power-Down register-----------------------------------*/
#define PHY_PWD_TXPWDFS                 BIT(10)
#define PHY_PWD_TXPWDIBIAS              BIT(11)
#define PHY_PWD_TXPWDV2I                BIT(12)
#define PHY_PWD_RXPWDENV                BIT(17)
#define PHY_PWD_RXPWD1PT1               BIT(18)
#define PHY_PWD_RXPWDDIFF               BIT(19)
#define PHY_PWD_RXPWDRX                 BIT(20)
#define PHY_PWD_MASK \
    (BIT_FIELD(0x7, 10) | BIT_FIELD(0xF, 17))
/*------------------PHY Transmitter control register--------------------------*/
#define PHY_TX_D_CAL(value)             BIT_FIELD((value), 0)
#define PHY_TX_D_CAL_MASK               BIT_FIELD(MASK(4), 0)
#define PHY_TX_D_CAL_VALUE(reg) \
    FIELD_VALUE((reg), PHY_TX_D_CAL_MASK, 0)

