stxent/halm/include/halm/platform/imxrt/usb_defs.h
#define PHY_TX_TXCAL45DN(value)         BIT_FIELD((value), 8)
#define PHY_TX_TXCAL45DN_MASK           BIT_FIELD(MASK(4), 8)
#define PHY_TX_TXCAL45DN_VALUE(reg) \
    FIELD_VALUE((reg), PHY_TX_TXCAL45DN_MASK, 8)

#define PHY_TX_TXCAL45DP(value)         BIT_FIELD((value), 16)
#define PHY_TX_TXCAL45DP_MASK           BIT_FIELD(MASK(4), 16)
#define PHY_TX_TXCAL45DP_VALUE(reg) \
    FIELD_VALUE((reg), PHY_TX_TXCAL45DP_MASK, 16)

#define PHY_TX_USBPHY_TX_EDGECTRL(value) \
    BIT_FIELD((value), 26)
#define PHY_TX_USBPHY_TX_EDGECTRL_MASK \
    BIT_FIELD(MASK(3), 26)
#define PHY_TX_USBPHY_TX_EDGECTRL_VALUE(reg) \
    FIELD_VALUE((reg), PHY_TX_USBPHY_TX_EDGECTRL_MASK, 26)
/*------------------PHY Receiver control register-----------------------------*/
#define PHY_RX_ENVADJ(value)            BIT_FIELD((value), 0)
#define PHY_RX_ENVADJ_MASK              BIT_FIELD(MASK(3), 0)
#define PHY_RX_ENVADJ_VALUE(reg) \
    FIELD_VALUE((reg), PHY_RX_ENVADJ_MASK, 0)

#define PHY_RX_DISCONADJ(value)         BIT_FIELD((value), 4)
#define PHY_RX_DISCONADJ_MASK           BIT_FIELD(MASK(3), 4)
#define PHY_RX_DISCONADJ_VALUE(reg) \
    FIELD_VALUE((reg), PHY_RX_DISCONADJ_MASK, 4)

#define PHY_RX_RXDBYPASS                BIT(22)
/*------------------PHY General Control register------------------------------*/
#define PHY_CTRL_ENOTG_ID_CHG_IRQ       BIT(0)
#define PHY_CTRL_ENHOSTDISCONDETECT     BIT(1)
#define PHY_CTRL_ENIRQHOSTDISCON        BIT(2)
#define PHY_CTRL_HOSTDISCONDETECT_IRQ   BIT(3)
#define PHY_CTRL_ENDEVPLUGINDETECT      BIT(4)
#define PHY_CTRL_DEVPLUGIN_POLARITY     BIT(5)
#define PHY_CTRL_OTG_ID_CHG_IRQ         BIT(6)
#define PHY_CTRL_ENOTGIDDETECT          BIT(7)
#define PHY_CTRL_RESUMEIRQSTICKY        BIT(8)
#define PHY_CTRL_ENIRQRESUMEDETECT      BIT(9)
#define PHY_CTRL_RESUME_IRQ             BIT(10)
#define PHY_CTRL_ENIRQDEVPLUGIN         BIT(11)
#define PHY_CTRL_DEVPLUGIN_IRQ          BIT(12)
#define PHY_CTRL_DATA_ON_LRADC          BIT(13)
#define PHY_CTRL_ENUTMILEVEL2           BIT(14)
#define PHY_CTRL_ENUTMILEVEL3           BIT(15)
#define PHY_CTRL_ENIRQWAKEUP            BIT(16)
#define PHY_CTRL_WAKEUP_IRQ             BIT(17)
#define PHY_CTRL_ENAUTO_PWRON_PLL       BIT(18)
#define PHY_CTRL_ENAUTOCLR_CLKGATE      BIT(19)
#define PHY_CTRL_ENAUTOCLR_PHY_PWD      BIT(20)
#define PHY_CTRL_ENDPDMCHG_WKUP         BIT(21)
#define PHY_CTRL_ENIDCHG_WKUP           BIT(22)
#define PHY_CTRL_ENVBUSCHG_WKUP         BIT(23)
#define PHY_CTRL_FSDLL_RST_EN           BIT(24)
#define PHY_CTRL_OTG_ID_VALUE           BIT(27)
#define PHY_CTRL_HOST_FORCE_LS_SE0      BIT(28)
#define PHY_CTRL_UTMI_SUSPENDM          BIT(29)
#define PHY_CTRL_CLKGATE                BIT(30)
#define PHY_CTRL_SFTRST                 BIT(31)
/*------------------PHY Status register---------------------------------------*/
#define PHY_STATUS_HOSTDISCONDETECT_STATUS \
    BIT(3)
#define PHY_STATUS_DEVPLUGIN_STATUS     BIT(6)
#define PHY_STATUS_OTGID_STATUS         BIT(8)
#define PHY_STATUS_RESUME_STATUS        BIT(10)
/*------------------PHY Debug register----------------------------------------*/
#define PHY_DEBUG_OTGIDPIOLOCK          BIT(0)
#define PHY_DEBUG_DEBUG_INTERFACE_HOLD  BIT(1)

#define PHY_DEBUG_HSTPULLDOWN(value)    BIT_FIELD((value), 2)
#define PHY_DEBUG_HSTPULLDOWN_MASK      BIT_FIELD(MASK(2), 2)
#define PHY_DEBUG_HSTPULLDOWN_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_HSTPULLDOWN_MASK, 2)

#define PHY_DEBUG_ENHSTPULLDOWN(value)  BIT_FIELD((value), 4)
#define PHY_DEBUG_ENHSTPULLDOWN_MASK    BIT_FIELD(MASK(2), 4)
#define PHY_DEBUG_ENHSTPULLDOWN_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_ENHSTPULLDOWN_MASK, 4)

#define PHY_DEBUG_TX2RXCOUNT(value)     BIT_FIELD((value), 8)
#define PHY_DEBUG_TX2RXCOUNT_MASK       BIT_FIELD(MASK(4), 8)
#define PHY_DEBUG_TX2RXCOUNT_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_TX2RXCOUNT_MASK, 8)

#define PHY_DEBUG_ENTX2RXCOUNT          BIT(0)

#define PHY_DEBUG_SQUELCHRESETCOUNT(value) \
    BIT_FIELD((value), 16)
#define PHY_DEBUG_SQUELCHRESETCOUNT_MASK \
    BIT_FIELD(MASK(5), 16)
#define PHY_DEBUG_SQUELCHRESETCOUNT_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_SQUELCHRESETCOUNT_MASK, 16)

#define PHY_DEBUG_ENSQUELCHRESET        BIT(24)

#define PHY_DEBUG_SQUELCHRESETLENGTH(value) \
    BIT_FIELD((value), 25)
#define PHY_DEBUG_SQUELCHRESETLENGTH_MASK \
    BIT_FIELD(MASK(4), 25)
#define PHY_DEBUG_SQUELCHRESETLENGTH_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_TX2RXCOUNT_MASK, 25)

#define PHY_DEBUG_HOST_RESUME_DEBUG     BIT(29)
#define PHY_DEBUG_CLKGATE               BIT(30)
/*------------------UTMI Debug Status register 0------------------------------*/
#define PHY_DEBUG0_LOOP_BACK_FAIL_COUNT(value) \
    BIT_FIELD((value), 0)
#define PHY_DEBUG0_LOOP_BACK_FAIL_COUNT_MASK \
    BIT_FIELD(MASK(16), 0)
#define PHY_DEBUG0_LOOP_BACK_FAIL_COUNT_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG0_LOOP_BACK_FAIL_COUNT_MASK, 0)

#define PHY_DEBUG0_UTMI_RXERROR_FAIL_COUNT(value) \
    BIT_FIELD((value), 16)
#define PHY_DEBUG0_UTMI_RXERROR_FAIL_COUNT_MASK \
    BIT_FIELD(MASK(10), 16)
#define PHY_DEBUG0_UTMI_RXERROR_FAIL_COUNT_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG0_UTMI_RXERROR_FAIL_COUNT_MASK, 16)

#define PHY_DEBUG_SQUELCH_COUNT(value) \
    BIT_FIELD((value), 26)
#define PHY_DEBUG_SQUELCH_COUNT_MASK \
    BIT_FIELD(MASK(6), 26)
#define PHY_DEBUG_SQUELCH_COUNT_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG_SQUELCH_COUNT_MASK, 26)
/*------------------UTMI Debug Status register 1------------------------------*/
enum
{
  ENTAILADJVD_NOMINAL   = 0,
  ENTAILADJVD_PLUS_20P  = 1,
  ENTAILADJVD_MINUS_20P = 2,
  ENTAILADJVD_MINUS_40P = 3
};

#define PHY_DEBUG1_ENTAILADJVD(value)   BIT_FIELD((value), 13)
#define PHY_DEBUG1_ENTAILADJVD_MASK     BIT_FIELD(MASK(2), 13)
#define PHY_DEBUG1_ENTAILADJVD_VALUE(reg) \
    FIELD_VALUE((reg), PHY_DEBUG1_ENTAILADJVD_MASK, 13)
/*------------------ANALOG VBUS Detect register-------------------------------*/
enum
{
  VBUSVALID_THRESH_4V0  = 0,
  VBUSVALID_THRESH_4V1  = 1,
  VBUSVALID_THRESH_4V2  = 2,
  VBUSVALID_THRESH_4V3  = 3,
  VBUSVALID_THRESH_4V4  = 4,
  VBUSVALID_THRESH_4V5  = 5,
  VBUSVALID_THRESH_4V6  = 6,
  VBUSVALID_THRESH_4V7  = 7
};

#define VBUS_DETECT_VBUSVALID_THRESH(value) \
    BIT_FIELD((value), 0)
#define VBUS_DETECT_VBUSVALID_THRESH_MASK \
    BIT_FIELD(MASK(3), 0)
#define VBUS_DETECT_VBUSVALID_THRESH_VALUE(reg) \
    FIELD_VALUE((reg), VBUS_DETECT_VBUSVALID_THRESH_MASK, 0)

#define VBUS_DETECT_VBUSVALID_PWRUP_CMPS \
    BIT(20)

