stxent/halm/include/halm/platform/imxrt/usb_defs.h
#define VBUS_DETECT_DISCHARGE_VBUS      BIT(26)
#define VBUS_DETECT_CHARGE_VBUS         BIT(27)
/*------------------ANALOG Charger Detect register----------------------------*/
#define CHRG_DETECT_CHK_CONTACT         BIT(18)
#define CHRG_DETECT_CHK_CHRG_B          BIT(19)
#define CHRG_DETECT_EN_B                BIT(20)
/*------------------ANALOG VBUS Detect Status register------------------------*/
#define VBUS_DETECT_STAT_SESSEND        BIT(0)
#define VBUS_DETECT_STAT_BVALID         BIT(1)
#define VBUS_DETECT_STAT_AVALID         BIT(2)
#define VBUS_DETECT_STAT_VBUS_VALID     BIT(3)
/*------------------ANALOG Charger Detect Status register---------------------*/
#define CHRG_DETECT_STAT_PLUG_CONTACT   BIT(0)
#define CHRG_DETECT_STAT_CHRG_DETECTED  BIT(1)
#define CHRG_DETECT_STAT_DM_STATE       BIT(2)
#define CHRG_DETECT_STAT_DP_STATE       BIT(3)
/*----------------------------------------------------------------------------*/
enum
{
  TOKEN_STATUS_TRANSACTION_ERROR  = 0x08,
  TOKEN_STATUS_BUFFER_ERROR       = 0x20,
  TOKEN_STATUS_HALTED             = 0x40,
  TOKEN_STATUS_ACTIVE             = 0x80,
};

struct TransferDescriptor
{
  volatile uint32_t next;
  volatile uint32_t token;
  volatile uint32_t buffer0;
  volatile uint32_t buffer1;
  volatile uint32_t buffer2;
  volatile uint32_t buffer3;
  volatile uint32_t buffer4;

  /* Project-specific fields */
  volatile uint32_t listNode;
};

struct QueueHead
{
  volatile uint32_t capabilities;
  volatile uint32_t current;
  volatile uint32_t next;
  volatile uint32_t token;
  volatile uint32_t buffer0;
  volatile uint32_t buffer1;
  volatile uint32_t buffer2;
  volatile uint32_t buffer3;
  volatile uint32_t buffer4;
  volatile uint32_t reserved;
  volatile uint32_t setup[2];

  /* Project-specific fields */
  volatile uint32_t listHead;
  volatile uint32_t listTail;

  volatile uint32_t gap[2];
};

#define QH_IOS                          BIT(15)
#define QH_MAX_PACKET_LENGTH(value)     BIT_FIELD((value), 16)
#define QH_MAX_PACKET_LENGTH_MASK       BIT_FIELD(MASK(10), 16)
#define QH_MAX_PACKET_LENGTH_VALUE(reg) \
    FIELD_VALUE((reg), QH_MAX_PACKET_LENGTH_MASK, 16)
#define QH_ZLT                          BIT(29)
#define QH_MULT(value)                  BIT_FIELD((value), 30)
#define QH_MULT_MASK                    BIT_FIELD(MASK(2), 30)
#define QH_MULT_VALUE(reg)              FIELD_VALUE((reg), QH_MULT_MASK, 30)

#define TD_NEXT_TERMINATE               BIT(0)

#define TD_TOKEN_STATUS(value)          BIT_FIELD((value), 0)
#define TD_TOKEN_STATUS_MASK            BIT_FIELD(MASK(8), 0)
#define TD_TOKEN_STATUS_VALUE(reg) \
    FIELD_VALUE((reg), TD_TOKEN_STATUS_MASK, 0)
#define TD_TOKEN_MULTO(value)           BIT_FIELD((value), 10)
#define TD_TOKEN_IOC                    BIT(15)
#define TD_TOKEN_TOTAL_BYTES(value)     BIT_FIELD((value), 16)
#define TD_TOKEN_TOTAL_BYTES_MASK       BIT_FIELD(MASK(15), 16)
#define TD_TOKEN_TOTAL_BYTES_VALUE(reg) \
    FIELD_VALUE((reg), TD_TOKEN_TOTAL_BYTES_MASK, 16)
/*----------------------------------------------------------------------------*/
#define EP_TO_DESCRIPTOR_NUMBER(ep) \
    ((((ep) & 0x0F) << 1) | (((ep) & 0x80) >> 7))
/*----------------------------------------------------------------------------*/
#endif /* HALM_PLATFORM_IMXRT_USB_DEFS_H_ */
